Tutorials/waveBoundaryLayer/stressOmega/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-12;

boundaryField
{
    top
    {
        type           slip; //fixedValue;
        //value uniform        1e-12;
    }

    bottom
    {
	    type		    zeroGradient;
    }
  
    cyclic1
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
    
    inlet
    {
      	    type		    zeroGradient;
	    // type            fixedValue;
	    //value           uniform 0.0;
    }
    
    outlet
    {
	    type		    zeroGradient;
    }

}

// ************************************************************************* //
