Tutorials/waveBoundaryLayer/stressOmega/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
        inlet
    {
        type            zeroGradient;
    }
     outlet
    {
        type            zeroGradient;
    }
    bottom
    {

        type            nutkRoughWallFunction;
        Cmu             0.09;
        kappa           0.41;
     //   E               9.8;
        Ks uniform 0.00084;
        Cs uniform 0.5;
        value           uniform 0;
      
    }
    top
    {
        type           slip;// calculated;
       // value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
