Tutorials/waveBoundaryLayer/stressOmega/constant/bodyForceDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      bodyForcingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


bodyForcing
{
    forceModel sinusoidalBodyForce;
    period 9.72;
    Um     2.0;
    constantSlope 0;
    forceDirection (1 0 0);
}


// ************************************************************************* //
