Tutorials/waveBoundaryLayer/stressOmega/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (  0 0 0 )
    ( 0.1 0 0 )
    (  0  0.005  0 )
    ( 0.1  0.005  0 )

                 
    (  0 0 0.1 ) //4
    (  0.1 0 0.1  ) //5
    (  0  0.005  0.1  ) //6
    ( 0.1  0.005  0.1  )  //7     


   (  0 0.145 0 ) //8
    ( 0.1 0.145 0 )//9
    (  0  0.145 0.1 ) //10
    ( 0.1  0.145  0.1 )//11
  
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) ( 2 10 1 ) simpleGrading (1 1 1)
    hex (2 3 9 8 6 7 11 10) ( 2 60 1 ) simpleGrading (1 10 1)
);

edges           
(
);

patches         
(
    patch inlet
    (
        (0 4 6 2)
        (2 6 10 8)
    )
    wall bottom 
    (
        (0 1 5 4)
    )
    patch outlet
    (
        (1 5 7 3)
        (3 7 11 9)
    )

    patch top 
    (
        (8 9 11 10)
    )
    
    empty frontAndBack
    (
        (0 1 3 2)
        (4 5 7 6)
        (2 3 9 8)
        (6 7 11 10)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
