Tutorials/waveBoundaryLayer/stressOmega/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("libbodyForce.so");
libs ("libRSM.so");

application myPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime        1953.72;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.4050;

purgeWrite      30;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.05; //0.25;

maxAlphaCo      0.05;//0.25;

maxDeltaT       1;



// ************************************************************************* //
